Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སེམས་ལས་བྱུང་བའི་འཇུག་པ་ཇི་སྙེད་པར་འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་ཆོས་སྟོན་པའི་གསུང་གི་ཡན་ལག་གི་རྣམ་པ་ཡང་དེ་སྙེད་དུ་འབྱུང་སྟེ།
en: However many are the thoughts of all beings and the actions that arise from those thoughts, that is how many types and divisions there are of the speech used by the realized one to teach the Dharma in order to satisfy all beings.

source: དེ་ལ་ཡང་དེ་བཞིན་གཤེགས་པ་ནི་རྣམ་པར་མི་རྟོག་ཅིང་། བཏང་སྙོམས་པའོ། །
en: Yet, in this respect, the realized one has no concept and is in a state of equanimity.

source: སྟོང་གསུམ་སེམས་ཅན་གང་ཡིན་པ། །
en: “If all beings in the cosmos of a billion worlds

source: དེ་དག་རང་རྒྱལ་འདྲེན་གྱུར་པས། །བསྐལ་པར་སེམས་ཅན་གཅིག་ཅིག་གི །
en: Were to become solitary buddhas and guides,

source: སེམས་ཀྱི་ཁམས་ཀྱང་མི་ཤེས་སོ། །
en: They could not comprehend the mental world

source: སེམས་ཅན་གཅིག་ཡིད་ཇི་སྙེད་པ། །
en: Of even a single being, even in an eon.

source: སངས་རྒྱས་ཀྱིས་ནི་རབ་མཁྱེན་ཀྱང་། །
en: “Though a perfect buddha knows

source: ང་ཡིས་ཡིད་འདི་ཤེས་སོ་ཞེས། །
en: The extent of a single being’s mind,

source: དེ་ནི་རྟོག་པར་མི་འགྱུར་རོ། །དུས་གསུམ་སེམས་ཅན་ཐམས་ཅད་ཀྱི།
en: He will not form the thought,

source: སེམས་པ་དག་ནི་ཇི་སྙེད་པ། །
en: ‘I know this being’s mind.’

source: འཇིག་རྟེན་མགོན་པོ་ཆོས་སྟོན་ཚེ། །
en: “When the Lord of the World teaches the Dharma,

source: དབྱངས་ཀྱི་ཡན་ལག་དེ་སྙེད་དོ། །
en: The types of his speech are equal To the number of thoughts Of all beings of the three times.

source: ཆོས་ཀྱི་བདག་པོ་གསུང་བ་ན། །
en: “When the Master of Dharma speaks,

source: དབྱངས་ཀྱི་ཡན་ལག་ཇི་སྙེད་པ། །
en: As many types of speech as he has,

source: ཆོས་ཀྱི་མིང་གིས་བཤད་པ་ཡི། །
en: The word dharma can express

source: ཆོས་བསྟན་པ་ཡང་དེ་ཙམ་མོ། །
en: Just as many teachings of the Dharma.

source: སེམས་ཅན་ཀུན་གྱི་གཟུགས་དང་ནི། །
en: “The light rays that issue from a single hair

source: མིང་དང་སེམས་པ་ཇི་སྙེད་པ། །སེམས་ཅན་སྙིང་པོའི་སྤུ་གཅིག་ནས། །
en: Of that Essence of Beings

source: འོད་ཟེར་འབྱུང་བ་དེ་སྙེད་དོ། །
en: Is equal in number to the appearances,

source: འཇིག་རྟེན་མགོན་པོའི་སྤུ་ཀུན་གྱི། །
en: Words, and thoughts of all beings.

source: འོད་ཟེར་དག་ནི་ཇི་སྙེད་པ། །མི་ཡི་དབང་པོ་ཆོས་སྟོན་ཚེ། །
en: “When the Master of Men teaches the Dharma,

source: གསུང་གི་ཡན་ལག་དེ་བས་མང་། །
en: The types of his speech are greater Than the number of light rays that issue From all the hair of that Lord of the World.

source: དཔེ་བཀོད་ནས་ནི་སངས་རྒྱས་ཀྱིས། །
en: “Analogously, even if a buddha

source: བསྐལ་པར་རབ་ཏུ་བསྟན་མཛད་ཀྱང་། །
en: Were to appear for an eon,

source: སངས་རྒྱས་ཀྱི་ནི་གསུང་དབྱངས་ཀྱི། མཐའ་མ་རྙེད་པར་མི་འགྱུར་རོ། །
en: One could not find an end To the sound of a buddha’s voice.

source: ཉོན་མོངས་གཟུགས་ཅན་མ་ཡིན་རྣམས། །
en: “Afflictions that are without form

source: གཟུགས་ཅན་མིན་པའི་ཚིག་གིས་བརྗོད།
en: Are described with formless words.

source: གཟུགས་ཅན་མིན་པའི་ཚིག་གིས་ནི། །
en: Yet, words that are without form

source: ཉོན་མོངས་གཟུགས་མེད་ཞི་བར་བྱེད། །
en: Can quell formless afflictions.

source: ཇི་ལྟར་ཚིག་ནི་གཟུགས་མེད་པ། །
en: “Just as words, being formless,

source: ཐམས་ཅད་དུ་ནི་མི་དམིགས་ཏེ། །
en: Cannot be found anywhere,

source: དེ་ལྟར་ཉོན་མོངས་གཟུགས་མེད་པ། །
en: Likewise the formless afflictions

source: ཤིན་ཏུ་དམིགས་པར་མི་འགྱུར་རོ། །
en: Are totally impossible to find.

source: ཇི་ལྟར་ཚིག་ནི་ཡོད་མིན་ཏེ། །
en: “Just as words, being nonexistent,

source: ནང་དང་ཕྱི་རོལ་མི་གནས་པ། །
en: Do not reside within or outside,

source: དེ་ལྟར་ཉོན་མོངས་རྣམས་མེད་ཅིང་། །
en: Likewise the nonexistent afflictions

source: ནང་དང་ཕྱི་རོལ་མི་གནས་སོ། །
en: Do not reside within or outside.

source: ཇི་ལྟར་ཕྱོགས་བཅུར་སངས་རྒྱས་གསུངས། །གང་ཡང་རྙེད་པར་མི་འགྱུར་བ། །
en: “Just as one cannot find anything to correspond To the speech of the buddhas in the ten directions,

source: དེ་ལྟར་ཉོན་མོངས་མི་དམིགས་ཀྱང་། །
en: Likewise, though afflictions cannot be found,

source: དེ་ནི་ཚིག་གིས་བརྗོད་པ་ཡིན། །
en: Words are used to describe them.

source: སེམས་ཅན་དག་ནི་ཀུན་གྱི་ཚིག །
en: “All the words of beings—

source: རབ་འབྲིང་ཐ་མ་གང་ཡིན་པ། །
en: The best, the middling, and the worst—

source: དེ་དག་ལུས་དང་སེམས་མི་གནས། །
en: Do not reside in the body or the mind,

source: གནས་པ་མེད་པའང་མ་ཡིན་ནོ། །
en: And yet they are not without a residence.

source: ཇི་ལྟར་སིལ་སྙན་འཁྲུལ་འཁོར་བྱས། །
en: “Just as a wind bell makes sound

source: རླུང་གིས་བསྐྱོད་ནས་སྒྲ་འབྱུང་བ། །
en: When moved by the wind—

source: སྒྲ་འབྱིན་བྱེད་པ་གང་ཡང་མེད། །
en: While no one is making the sound,

source: འོན་ཀྱང་སྒྲ་རྣམས་དེ་དག་འབྱུང་། །
en: Nonetheless, it makes sound—

source: དེ་ལྟར་སྔོན་ཆད་རྣམ་དག་ཕྱིར། །
en: “Similarly, due to their past purification,

source: སེམས་ཅན་ཀུན་གྱི་བསམ་པས་བསྐྱོད། །སངས་རྒྱས་ཀྱི་ནི་གསུང་འབྱུང་ཡང་། །
en: The speech of the buddhas comes out, Moved by the motivations of all beings.

source: འདི་ལ་དེ་ནི་རྟོག་མི་མངའ། །
en: Yet buddhas form no ideas about this.

source: ཇི་ལྟར་བྲག་ཆ་རྣམས་ཀྱི་སྒྲ། །
en: “Just like the sound of echoes

source: དེ་ལྟར་མི་ཡི་དབང་པོའི་གསུང་། །
en: Likewise the speech of the Master of Men

source: ཇི་ལྟར་རིན་ཆེན་མི་རྟོག་པར། །
en: “Just as a precious jewel, being without any concept,

source: སྣང་བས་སེམས་ཅན་ཚིམ་བྱེད་པ། །
en: Can satisfy beings with its radiance,

source: དེ་ལྟར་རྒྱལ་བ་མི་རྟོག་གསུང་། །
en: Likewise the speech of the victors, who do not form concepts,

source: སྒྲ་ཀུན་རབ་ཏུ་རྫོགས་པར་བྱེད། །
en: Can bring all sounds to perfection.

source: ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཆོས་སྟོན་པར་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Furthermore, Śāntamati, you should know that the secret of the speech of a realized one is the fact that the Dharma is taught according to the languages used by all beings.

source: ཞི་བའི་བློ་གྲོས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་སྐྱེ་བའི་གནས་ཐ་དད་པ་དག་ཡོད་པ་རྣམས་སུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་རྣམས་ཀྱི་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་བདེན་པ་རྣམས་ཀྱི་མིང་ཐ་དད་པ་དག་གིས་རྣམ་པར་གཞག་གོ །ཞི་བའི་བློ་གྲོས་འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་།
en: Śāntamati, a realized one establishes the teaching by using different words for the truths according to the languages used by beings, depending on the different places of rebirth for beings in this cosmos of a billion worlds.

source: སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ས་བླ་པའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཟ་བ་དང་། ཟ་བའི་རྩ་བ་དང་། ཟ་བ་སེལ་དང་། ཟ་བ་འགོག་བྱེད་ཅེས་བྱའོ། །
en: “For instance, Śāntamati, what is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the earth-dwelling gods as ‘consumption, the root of consumption, the removal of consumption, and causing consumption to stop.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ། བར་སྣང་གི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། འཇུག་པ་དང་། ཀུན་ཏུ་འཇུག་བྱེད་པ་དང་། ཀུན་ཏུ་འཇུག་བྲལ་དང་། ཀུན་ཏུ་འཇུག་སྒྲོལ་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the sky-dwelling gods as ‘aggregation, the cause of aggregation, freedom from aggregation, and freeing one from aggregation.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། འབྱུང་བ་དང་། དཔོག་པ་དང་། སྲེག་པ་དང་། འཇིག་བྱེད་ཅེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods in the Heaven of the Four Great Kings as ‘arising, measuring, burning, and destroying.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། འཁོར་བ་དང་། ཀུན་སྙེན་དང་། ཟད་པ་དང་། ཟད་པ་ལྡོག་བྱེད་ཅེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of the Thirty-Three as ‘circling, embracing, extinction, and returning to extinction.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། །སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་འཐབ་བྲལ་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། གནོད་པ་དང་། གནོད་པ་སྙེན་དང་། གནོད་པ་ཟད་དང་། གནོད་པ་ཟད་པར་སྒོམ་པ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དགའ་ལྡན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཤིན་ཏུ་མི་སྲུན་དང་། མི་སྲུན་རྩ་བ་དང་། ལྡོག་པ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Yāma Heaven as ‘harm, drawing harm near, extinction of harm, and cultivating the extinction of harm.’

source: ཡང་དག་པར་ལྡོག་བྱེད་ཅེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་འཕྲུལ་དགའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྐྱལ་པ་དང་། ཀུན་ཏུ་རྒྱལ་བྱེད་དང་། རྐྱལ་ཟད་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of gods of the Heaven of the Contented as ‘total wickedness, the root of wickedness, disengagement, and causing complete disengagement.’

source: རྐྱལ་ཟད་སྒོ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཧ་ཧ་ཧོ་དང་། ཧ་ཧ་ཐོབ་བྱེད་དང་། ཧ་ཧ་བྲལ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of gods of the Heaven of Those Whose Delight Comes From Magical Creations as ‘a leather bag full of air, the cause of the leather bag, deflating the leather bag, and the gateway to the deflation of the leather bag.’

source: ཧ་ཧ་བྲལ་བྱེད་ཅེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་བདུད་ཀྱི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མེ་མུར་དང་། མེ་མུར་གནོད་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of gods of the Heaven of Those Who Possess the Power to Transform Others’ Delight into Their Own as ‘augh!, the cause of obtaining augh!, freedom from augh!, and the cause of freedom from augh!’

source: མེ་མུར་འདོར་འདོད་དང་། མེ་མུར་སྒྲོལ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་།
en: “Śāntamati, what is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the māras as ‘burning coals, the harm leading to burning coals, the desire to reject the burning coals, and liberating one from burning coals.’

source: སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་པའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། སྡུག་པ་དང་། སྡུག་བྱེད་དང་། སྡུག་པ་ཉལ་དང་། སྡུག་པར་འཁོར་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the brahmās as ‘pain, the cause of pain, rest from pain, and encircling pain.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། འཛག་པ་དང་། ཀུན་ཏུ་འཛག་བྱེད་དང་། རྒྱུན་གཅོད་དང་། ཤིན་ཏུ་འབྱུང་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Brahmā’s Assembly as ‘dripping, the cause of dripping, stoppage, and complete emergence.’

source: སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་པའི་མདུན་ན་འདོན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྨ་དང་། རྨའི་མཚམས་སྦྱོར་བ་དང་། རྨ་རུབ་དང་། རྨ་ཉེ་བར་ཞི་བྱེད་ཅེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Brahmā’s Priests as ‘wound, opening the wound, closed wound, and healing the wound.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚངས་ཆེན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྐྱལ་བྱེད་དང་། རྣམ་པར་རྐྱལ་བྱེད་དང་། རྐྱལ་པ་མཐར་བྱེད་དང་། བྱེད་པ་ཐོབ་བྱེད་ཅེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Great Brahmā as ‘causing a flood, causing detritus, bringing the flood to an end, and causing the attainment of the cause.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་འོད་ཆུང་གི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཧ་ཧི་དང་། ཧེ་ཧི་དང་། ཧུ་ཧུ་དང་། ཧ་ར་ནུ་སན་དྷི་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Limited Radiance as ‘oh, no!, ah, no!, ugh, no!,’ and what sounds like ‘hara!’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དགེ་ཆུང་གི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཨོ་ཧི་ཏ་དང་། ནི་བ་ཧི་ཏ་དང་། ནི་ག་ཀྵི་ཏ་དང་། ནི་ག་མ་ནི་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Limited Splendor as ‘ohita, nivahita, nigakṣita, and nigamani.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཚད་མེད་དགེ་བའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། སྟེན་པ་དང་། ཡང་དག་པར་སྟེན་པ་དང་། ཟད་པ་སྟེན་པ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Immeasurable Splendor as ‘service, correct service, extinction of service, and reverence.’

source: ཀུན་ཏུ་སྟེན་པ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་དགེ་རྒྱས་ཀྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། ཡོངས་གཅོད་དང་། ཡོངས་གཅོད་འབྱུང་དང་། ཁྱིམ་མཐའ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Total Splendor as ‘division, emergence of division, close to home, and always pure.’

source: རྟག་ཏུ་རྣམ་དག་ཅེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་མི་ཆེ་བའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། རྗེས་སུ་འགྲོ་བ་དང་། མི་འོང་མ་ཡིན་པ་དང་། རྗེས་ཀྱི་མཚམས་དང་། རྗེས་ཀྱི་མཚམས་འགྲོ་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Smaller Heaven of the Pure as ‘following, always returning, association, going to association.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་མི་གདུང་བའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། དག་པ་དང་། དག་པ་ཅན་དང་། དག་པ་ཡོངས་དག་དང་། དག་པ་འགྲོ་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of the Cool as ‘purity, possessing purity, purifying purity, and going to purity.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་གྱ་ནོམ་སྣང་གི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མ་མ་མ་མ་དང་། མ་མ་མ་མེ་དང་། མ་ན་ནུ་ན་ཡ་དང་། མ་ན་ནུ་ག་མ་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of the Beautiful Ones as ‘mamamama, mamamame, mananunaya, and mananugama.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་ཤིན་ཏུ་མཐོང་གི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། གྲོལ་བ་དང་། གྲོལ་བ་ཅན་དང་། གྲོལ་བའི་རྩ་བ་དང་། གྲོལ་བའི་བྱེ་བྲག་ཕྱེད་པར་མཚམས་སྦྱོར་བ་ཞེས་བྱའོ། །འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་།
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of the Clear-Sighted Ones as ‘freedom, possessing freedom, root of freedom,’ and what could be rendered as ‘the place of freedom.’

source: སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་འབྲས་བུ་ཆེ་བའི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མི་བྱ་བ་དང་། མི་བྱེད་པ་དང་། བྱེད་བྲལ་དང་། བྱེད་པ་མཐར་ཐུག་ཅེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods of the Heaven of Great Results as ‘what is unmade, inactivity, freedom from activity, and apex of activity.’

source: འདིར་སྡུག་བསྔལ་དང་། སྡུག་བསྔལ་ཀུན་འབྱུང་བ་དང་། སྡུག་བསྔལ་འགོག་པ་དང་། སྡུག་བསྔལ་འགོག་པར་འགྲོ་བའི་ལམ་ཞེས་བྱ་བ་གང་ཡིན་པ་དེ་གནས་གཙང་མའི་རིས་འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱི་འདི་སྐད་ཅེས་བྱ་སྟེ། མཐར་ཐུག་དང་། ཤིན་ཏུ་མཐར་ཐུག་དང་། མི་རྟོག་པ་དང་། ཉིང་མཚམས་སྦྱོར་བ་མེད་པ་ཞེས་བྱའོ། །
en: “What is known here as ‘suffering, origin of suffering, cessation of suffering, and the path that leads to the cessation of suffering’ is described in the language of the gods who dwell in the pure realm of the Supreme Heaven as ‘apex, true apex, unmaking, and reconnection.’

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ཇི་ལྟར་ལྷ་རྣམས་ཀྱི་བདེན་པ་རྣམ་པར་གཞག་པ་དེ་བཞིན་དུ་ཀླུ་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །གནོད་སྦྱིན་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །དྲི་ཟ་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །ལྷ་མ་ཡིན་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །ནམ་མཁའ་ལྡིང་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །མི་འམ་ཅི་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །གནོད་སྦྱིན་ལག་ན་གཞོང་ཐོགས་རྣམས་ཀྱི་ཡང་གཞན་ནོ། །ཕྲེང་ཐོགས་རྣམས་ཀྱི་བདེན་པ་རྣམ་པར་གཞག་པ་ཡང་གཞན་ཡིན་ནོ། །
en: “In this way, Śāntamati, just as there are differences among the gods with respect to the truths, there are likewise differences with respect to the truths among the nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, karoṭapāṇi yakṣas, and mālādhārins.

source: ཞི་བའི་བློ་གྲོས་གང་ཡུལ་ཆེན་པོ་བཅུ་དྲུག་ཏུ་བསྡུ་བས་བསྡུས་པའི་ཡུལ་སྟོང་གིས་འཛམ་བུའི་གླིང་འདི་ཡོངས་སུ་གང་སྟེ། གང་ན་མི་རྣམས་ཀྱི་ཚིག་ཀྱང་གཞན། ངེས་པའི་ཚིག་ཀྱང་གཞན།
en: “Furthermore, Śāntamati, here on Jambudvīpa, which is filled with a thousand countries subsumed within the sixteen great countries, each community of people has its own language, its own terminology, and its own conventions.

source: བརྡ་ཡང་ཐ་དད་པ་དེར་ཡང་དེ་བཞིན་གཤེགས་པས་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མིང་ཐ་དད་པ་རྣམས་ཀྱིས་བདེན་པ་དག་རྣམ་པར་བཀོད་དེ། འདི་ལྟ་སྟེ། ཡུལ་ཀ་ཤ་དང་། པ་ཧུ་པ་དང་། ཐོ་གར་ཡུལ་དང་། ཡ་བ་ན་དང་། ཀམ་པོ་ཛ་དང་། ཁ་ཤ་དང་། ཧུ་ན་དང་། རྒྱ་ཡུལ་དང་། ད་ར་ཏ་དང་། ཨུ་ར་ཤ་དང་། པི་ལིན་དང་། པོ་མ་དང་། བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། རྗེའུ་རིགས་དང་། དམངས་རིགས་དང་། ད་ཙི་པ་དང་། ཀི་ར་ཏ་དང་། པུ་ལིན་ཏ་དང་། པུན་དྲ་དང་། ཀུ་རུ་ན་དང་། ལྔ་ལེན་དང་།
en: So, here, too, the Realized One establishes the truths in various names by employing the languages found here.

source: ཤར་ཕྱོགས་དང་། ཕུ་རུ་ར་བ་དང་། ལྷོ་ཕྱོགས་དང་། ཀ་ལིང་ཀ་དང་། གཅེར་བུ་དང་། བ་ན་ས་ཀ་དང་། བ་ན་ཏ་དང་། སྦལ་ཀ་དང་། ཁྱི་གདོང་དང་། ཝ་གདོང་དང་། ཀྲི་བ་ཤའི་གདོང་དང་། སྤྱིའུ་ཚུགས་པ་དང་། གནམ་གདོང་པོ་དང་། ཕྱི་ཕྱོགས་གདོང་དང་། བྱང་མཚམས་གདོང་དང་། རྗེས་སུ་རྒྱུག་དང་། རྒྱ་མཚོ་ཁོལ་བ་དང་། ཡུལ་མཐས་གཏུགས་པ་དང་། ཨང་ཀུ་ར་དང་། མང་གུར་དང་། སྣ་མེད་དང་། གློ་བཀྲ་དང་། ཕྱོགས་ཀྱི་གཅེར་བུ་དང་། གཤོག་ཐོགས་གཅེར་བུ་དང་། དགུས་ཏེ་འགྲོ་དང་།
en: So, for example, among the thousand countries that fill Jambudvīpa are those of the Śakas, the Pahlavas, the Tukhāras, the Yavanas, the Kambojas, the Khaṣas, the Hūnas, the Cīnas, the Daradas, the Uraśas, the Pilidas, the Sāmas, the Brāhmaṇas, the Kṣatriyas, the Vaiśyas, the Śūdras, the Vacivas, the Kiratas, the Pulindas, the Maruṇḍas, the Kurus, the Pañcālas, the Easterners, the Pauravas, the Southerners, the Kaliṅgas, the Śabaras, the Vanasakas, the Paṇatas, the Sālakas, the Dog-Faced People, the Jackal-Faced People, the Kṛviṣa-Faced People, the Downward-Facing People, the Upward-Facing People, the Sideways-Facing People, the People of the Northern Borders, the Westward-Moving People, the People on the Coasts, the People of the Adjoining Lands, the Aṅkuras, the Makuras, the Snub-Nosed People, the Sabala-pārśvas, the Pārśva-śabaras, the Parṇa-śabaras, the Kukṣa-śabaras, as well as those who descend from the ancient past and those who dwell in areas beyond these lands.

source: རྫོགས་བྱེད་རྣམ་པ་དང་། འཇིག་རྟེན་གྱི་བར་ན་གནས་པའི་ཡུལ་ལ་སོགས་པ་ཡུལ་སྟོང་གིས་འཛམ་བུའི་གླིང་ཡོངས་སུ་གང་སྟེ། ཞི་བའི་བློ་གྲོས་གང་ན་མི་རྣམས་ཀྱི་ཚིག་དང་། ངེས་པའི་ཚིག་དང་། བརྡ་ཐ་དད་པ་དེར་ཡང་དེ་བཞིན་གཤེགས་པས་སྐད་ཀྱི་འཇུག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མིང་ཐ་དད་པ་རྣམས་ཀྱིས་བདེན་པ་དག་བསྟན་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཀྱི་རྗེས་སུ་འབྲང་བ་མ་ཡིན་ཞིང་།
en: Each of these places, Śāntamati, has its own language, its own terminology, and its own conventions, and the Realized One sets forth the truths in various names by employing the languages found therein.

source: རྣམ་པར་ཤེས་པའི་རྗེས་སུ་འབྲང་བ་མ་ཡིན་པ་འབྱུང་ངོ་། །
en: And still, the Realized One’s speech does not come out preceded by any thought or cognition.

source: ཞི་བའི་བློ་གྲོས་སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བདེན་པ་མིང་ཐ་དད་པས་བསྟན་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་བཞི་ཡོད་དེ་བདེན་པ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་འདི་ལྟ་སྟེ།
en: “In this galaxy of a thousand worlds, Śāntamati, ninety-four hundred thousands of millions and billions of truths circulate and are taught under various names.

source: དོན་དམ་པའི་བདེན་པ་དང་། སྐྱེ་བ་མེད་པའི་བདེན་པ་དང་། ཇི་ལྟ་བ་བཞིན་གྱི་བདེན་པ་དང་། མི་འཁྲུགས་པའི་བདེན་པར་དོན་གཅིག་ཏུ་ཡང་དག་པར་འདུས་ཏེ།
en: Yet, all of these presentations of the truths converge upon a single meaning, that is, on an ultimate truth, a truth that has no point of origination, a truth that accords with the way things are, an unshakable truth.

source: ཞི་བའི་བློ་གྲོས་འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་གི་གསང་བའོ།། །།བམ་པོ་ལྔ་པ།
en: This, too, Śāntamati, is the secret of the speech of a realized one.

source: ཞི་བའི་བློ་གྲོས་གཞན་ཡང་དེ་བཞིན་གཤེགས་པའི་གསུང་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོགས་པ་གཅོད་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སོམ་ཉི་སེལ་བའོ། །
en: “Moreover, Śāntamati, the speech of a realized one dispels the doubts of all beings and eliminates their hesitancy.
